import Image from "next/image";
import FAQItem from "../components/FAQItem";

const FAQList = () => {
  const faqs = [
    {
      question: '۱. خدمات سایت "درخت من" چیست؟',
      answer:
        'سایت "درخت من" به شما این امکان را می‌دهد که درختانی را به یادبود مناسبت‌های مختلف مانند عروسی، تولد، فوت و غیره در مکان‌های دلخواه خود بکارید. علاوه بر این، می‌توانید داستان و یادگاری خود را با دیگران به اشتراک بگذارید.',
    },
    {
      question: "۲. چگونه می‌توانم درخت مورد نظر خود را انتخاب کنم؟",
      answer:
        "شما می‌توانید با مراجعه به صفحه محصولات، درختان موجود را مشاهده کرده و بر اساس نیاز خود انتخاب کنید. سپس با پر کردن اطلاعات شخصی و انتخاب محل کاشت، می‌توانید سفارش خود را ثبت کنید.",
    },
    {
      question: "۳. آیا می‌توانم تم خاصی برای درخت خود انتخاب کنم؟",
      answer:
        "بله، شما می‌توانید از میان تم‌های مختلف مانند عروسی، تولد، یادبود و غیره انتخاب کنید تا درخت شما به مناسبت مورد نظر شخصی‌سازی شود.",
    },
    {
      question: "۴. آیا می‌توانم ویدیو و صدا به سفارش خود اضافه کنم؟",
      answer:
        "بله، شما می‌توانید با پرداخت هزینه اضافی، ویدیو، صدا و فیلم‌های خود را به سفارش خود اضافه کنید.",
    },
    {
      question: "۵. چگونه می‌توانم داستان درخت خود را بنویسم؟",
      answer:
        "پس از انتخاب درخت و تکمیل اطلاعات، شما می‌توانید داستان خود را در قسمت مخصوص به آن وارد کنید. این داستان به همراه QR Code به درخت شما متصل خواهد شد.",
    },
    {
      question: "۶. چگونه می‌توانم پرداخت را انجام دهم؟",
      answer:
        "شما می‌توانید از طریق درگاه‌های پرداخت معتبر، هزینه درخت و خدمات اضافی را پرداخت کنید.",
    },
    {
      question:
        "۷. چگونه می‌توانم داستان درخت خود را با دیگران به اشتراک بگذارم؟",
      answer:
        "هر درخت به یک QR Code متصل است که با اسکن آن، دیگران می‌توانند داستان شما را مشاهده و بشنوند.",
    },
    {
      question: "۸. آیا امکان هدیه دادن به داستان‌های دیگران وجود دارد؟",
      answer:
        "بله، کاربران می‌توانند با استفاده از کیف پول خود، به داستان‌های دیگران هدیه دهند.",
    },
    {
      question: "۹. آیا در آینده امکانات جدیدی به سایت اضافه می‌شود؟",
      answer:
        "بله، ما در حال برنامه‌ریزی برای افزودن امکانات جدیدی از جمله صفحات فروم برای تعامل کاربران و خدمات باغبان هستیم.",
    },
    {
      question: "۱۰. چگونه می‌توانم از خدمات باغبان استفاده کنم؟",
      answer:
        "در فازهای بعدی، شما می‌توانید باغبان را برای کاشت درخت خود سفارش دهید. پس از انجام کار، می‌توانید مبلغ را به کیف پول باغبان واریز کنید و به او نمره دهید.",
    },
    {
      question: "۱۱. آیا می‌توانم درختان را به صورت عمده سفارش دهم؟",
      answer:
        "بله، در فازهای بعدی ما امکان سفارش عمده درختان برای مغازه‌های درخت‌فروشی را نیز فراهم خواهیم کرد.",
    },
  ];

  return (
    <>
      <div>
        <div className="lg:relative lg:mt-14 w-full h-72 object-cover">
          <Image
            priority
            src="/svgs/company_headers/faqHeader.svg"
            width={0}
            height={0}
            alt="contact us header"
            className="w-full h-72 object-cover absolute -top-4 "
          />
        </div>
      </div>
      <div className="md:container md:mx-auto md:pt-5 min-h-[65vh]">
        <main className="m-4 md:my-8 rounded-xl" dir="rtl">
          <div className="h-full w-full bg-white rounded-3xl p-14">
            {faqs.map((faq, index) => (
              <FAQItem
                key={index}
                question={faq.question}
                answer={faq.answer}
              />
            ))}
          </div>
        </main>
      </div>
    </>
  );
};

export default FAQList;
